In [16]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [17]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [18]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101', periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))

In [8]:
df

                   A         B         C         D
2013-01-01  1.440914 -1.993925  0.939672 -1.615377
2013-01-02 -1.357746  1.707949  1.173755 -0.115115
2013-01-03  0.314631 -1.716743  0.115004 -2.396208
2013-01-04  0.019305 -0.857035 -0.998541 -1.531203
2013-01-05 -0.178828 -0.059768  0.806884  0.995525
2013-01-06  0.873309  1.004962 -1.225977 -0.108438

In [9]:
df2 = pd.DataFrame({'A':1.,
                   'B':pd.Timestamp('20130102'),
                   'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                   'D':np.array([3] * 4, dtype='int32'),
                   'E':pd.Categorical(["test","train","test","train"]), 
                   'F': 'foo'})

In [10]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
df.head()

                   A         B         C         D
2013-01-01  1.440914 -1.993925  0.939672 -1.615377
2013-01-02 -1.357746  1.707949  1.173755 -0.115115
2013-01-03  0.314631 -1.716743  0.115004 -2.396208
2013-01-04  0.019305 -0.857035 -0.998541 -1.531203
2013-01-05 -0.178828 -0.059768  0.806884  0.995525

In [13]:
df.tail()

                   A         B         C         D
2013-01-02 -1.357746  1.707949  1.173755 -0.115115
2013-01-03  0.314631 -1.716743  0.115004 -2.396208
2013-01-04  0.019305 -0.857035 -0.998541 -1.531203
2013-01-05 -0.178828 -0.059768  0.806884  0.995525
2013-01-06  0.873309  1.004962 -1.225977 -0.108438

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [42]:
df.to_numpy()

array([[ 0.79266613, -0.1958382 , -0.67671135, -1.38239939],
       [-1.1270379 ,  0.02563488, -1.50323377, -0.26597754],
       [-0.38411989, -0.20359686,  0.94387828,  0.00897757],
       [-0.71574176,  1.36244129,  1.06643891, -0.54890957],
       [ 0.24269266, -0.1625185 , -0.48253773,  0.59577272],
       [-0.96937322, -1.7237544 , -1.29409094,  0.23407558]])

In [43]:
#
# describe:
#    DataFrameの各列の平均、標準偏差など要約統計量の取得
#
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.360152 -0.149605 -0.324376 -0.226410
std    0.745479  0.979812  1.097456  0.690698
min   -1.127038 -1.723754 -1.503234 -1.382399
25%   -0.905965 -0.201657 -1.139746 -0.478177
50%   -0.549931 -0.179178 -0.579625 -0.128500
75%    0.085990 -0.021403  0.587274  0.177801
max    0.792666  1.362441  1.066439  0.595773

In [78]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.792666   -1.127038   -0.384120   -0.715742    0.242693   -0.969373
B   -0.195838    0.025635   -0.203597    1.362441   -0.162519   -1.723754
C   -0.676711   -1.503234    0.943878    1.066439   -0.482538   -1.294091
D   -1.382399   -0.265978    0.008978   -0.548910    0.595773    0.234076

In [95]:
#
# sort --- sort_index()
#        sort_index()
#               axis = 0 or index
#               axis = 1 or columns
#
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.382399 -0.676711 -0.195838  0.792666
2013-01-02 -0.265978 -1.503234  0.025635 -1.127038
2013-01-03  0.008978  0.943878 -0.203597 -0.384120
2013-01-04 -0.548910  1.066439  1.362441 -0.715742
2013-01-05  0.595773 -0.482538 -0.162519  0.242693
2013-01-06  0.234076 -1.294091 -1.723754 -0.969373

In [94]:
df.sort_values(axis=0, by='B', ascending=True)

                   A         B         C         D
2013-01-06 -0.969373 -1.723754 -1.294091  0.234076
2013-01-03 -0.384120 -0.203597  0.943878  0.008978
2013-01-01  0.792666 -0.195838 -0.676711 -1.382399
2013-01-05  0.242693 -0.162519 -0.482538  0.595773
2013-01-02 -1.127038  0.025635 -1.503234 -0.265978
2013-01-04 -0.715742  1.362441  1.066439 -0.548910

In [51]:
#
# DataFrameの任意の位置にあるデータを選択、処理
# 　　at,  loc    行ラベル, 列ラベル
#     iat, iloc   行番号, 列番号
#
df.loc[dates[0]]

A    0.792666
B   -0.195838
C   -0.676711
D   -1.382399
Name: 2013-01-01 00:00:00, dtype: float64

In [52]:
df.loc[dates[2]]

A   -0.384120
B   -0.203597
C    0.943878
D    0.008978
Name: 2013-01-03 00:00:00, dtype: float64

In [76]:
df.loc[:,['A','C']]

                   A         C
2013-01-01  0.792666 -0.676711
2013-01-02 -1.127038 -1.503234
2013-01-03 -0.384120  0.943878
2013-01-04 -0.715742  1.066439
2013-01-05  0.242693 -0.482538
2013-01-06 -0.969373 -1.294091

In [58]:
#
#  値、インデックス　条件(大小関係）を満たす要素からDataFrame
#                   boolian condition
#
df

                   A         B         C         D
2013-01-01  0.792666 -0.195838 -0.676711 -1.382399
2013-01-02 -1.127038  0.025635 -1.503234 -0.265978
2013-01-03 -0.384120 -0.203597  0.943878  0.008978
2013-01-04 -0.715742  1.362441  1.066439 -0.548910
2013-01-05  0.242693 -0.162519 -0.482538  0.595773
2013-01-06 -0.969373 -1.723754 -1.294091  0.234076

In [104]:
df[dates.day<4]

                   A         B         C         D
2013-01-01  0.792666 -0.195838 -0.676711 -1.382399
2013-01-02 -1.127038  0.025635 -1.503234 -0.265978
2013-01-03 -0.384120 -0.203597  0.943878  0.008978

In [63]:
df[df.A>0]

                   A         B         C         D
2013-01-01  0.792666 -0.195838 -0.676711 -1.382399
2013-01-05  0.242693 -0.162519 -0.482538  0.595773

In [105]:
df[df>0]

                   A         B         C         D
2013-01-01  0.792666       NaN       NaN       NaN
2013-01-02       NaN  0.025635       NaN       NaN
2013-01-03       NaN       NaN  0.943878  0.008978
2013-01-04       NaN  1.362441  1.066439       NaN
2013-01-05  0.242693       NaN       NaN  0.595773
2013-01-06       NaN       NaN       NaN  0.234076

In [106]:
#
#  filtering   isin()
#
df2 = df.copy()

                   A         B         C         D
2013-01-01  0.792666 -0.195838 -0.676711 -1.382399
2013-01-02 -1.127038  0.025635 -1.503234 -0.265978
2013-01-03 -0.384120 -0.203597  0.943878  0.008978
2013-01-04 -0.715742  1.362441  1.066439 -0.548910
2013-01-05  0.242693 -0.162519 -0.482538  0.595773
2013-01-06 -0.969373 -1.723754 -1.294091  0.234076

In [107]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [108]:
df2

                   A         B         C         D      E
2013-01-01  0.792666 -0.195838 -0.676711 -1.382399    one
2013-01-02 -1.127038  0.025635 -1.503234 -0.265978    one
2013-01-03 -0.384120 -0.203597  0.943878  0.008978    two
2013-01-04 -0.715742  1.362441  1.066439 -0.548910  three
2013-01-05  0.242693 -0.162519 -0.482538  0.595773   four
2013-01-06 -0.969373 -1.723754 -1.294091  0.234076  three

In [114]:
df2[df2['E'].isin(['two','three'])]

                   A         B         C         D      E
2013-01-03 -0.384120 -0.203597  0.943878  0.008978    two
2013-01-04 -0.715742  1.362441  1.066439 -0.548910  three
2013-01-06 -0.969373 -1.723754 -1.294091  0.234076  three

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04     True
2013-01-05    False
2013-01-06     True
Freq: D, Name: E, dtype: bool

In [121]:
#Setting

In [122]:
df

                   A         B         C         D
2013-01-01  0.792666 -0.195838 -0.676711 -1.382399
2013-01-02 -1.127038  0.025635 -1.503234 -0.265978
2013-01-03 -0.384120 -0.203597  0.943878  0.008978
2013-01-04 -0.715742  1.362441  1.066439 -0.548910
2013-01-05  0.242693 -0.162519 -0.482538  0.595773
2013-01-06 -0.969373 -1.723754 -1.294091  0.234076

In [123]:
df.mean()

A   -0.360152
B   -0.149605
C   -0.324376
D   -0.226410
dtype: float64

In [124]:
df.mean(1)

2013-01-01   -0.365571
2013-01-02   -0.717654
2013-01-03    0.091285
2013-01-04    0.291057
2013-01-05    0.048352
2013-01-06   -0.938286
Freq: D, dtype: float64

In [125]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates)

In [126]:
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [134]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [135]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [140]:
df.sub(s,axis='index')

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03 -1.384120 -1.203597 -0.056122 -0.991022
2013-01-04 -3.715742 -1.637559 -1.933561 -3.548910
2013-01-05 -4.757307 -5.162519 -5.482538 -4.404227
2013-01-06       NaN       NaN       NaN       NaN

In [142]:
df

                   A         B         C         D
2013-01-01  0.792666 -0.195838 -0.676711 -1.382399
2013-01-02 -1.127038  0.025635 -1.503234 -0.265978
2013-01-03 -0.384120 -0.203597  0.943878  0.008978
2013-01-04 -0.715742  1.362441  1.066439 -0.548910
2013-01-05  0.242693 -0.162519 -0.482538  0.595773
2013-01-06 -0.969373 -1.723754 -1.294091  0.234076

In [148]:
#Apply
df

                   A         B         C         D
2013-01-01  0.792666 -0.195838 -0.676711 -1.382399
2013-01-02 -1.127038  0.025635 -1.503234 -0.265978
2013-01-03 -0.384120 -0.203597  0.943878  0.008978
2013-01-04 -0.715742  1.362441  1.066439 -0.548910
2013-01-05  0.242693 -0.162519 -0.482538  0.595773
2013-01-06 -0.969373 -1.723754 -1.294091  0.234076

In [149]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.792666 -0.195838 -0.676711 -1.382399
2013-01-02 -0.334372 -0.170203 -2.179945 -1.648377
2013-01-03 -0.718492 -0.373800 -1.236067 -1.639399
2013-01-04 -1.434233  0.988641 -0.169628 -2.188309
2013-01-05 -1.191541  0.826123 -0.652166 -1.592536
2013-01-06 -2.160914 -0.897632 -1.946257 -1.358461

In [150]:
df.apply(lambda x: x.max() - x.min())

A    1.919704
B    3.086196
C    2.569673
D    1.978172
dtype: float64

In [156]:
df.apply(max)

A    0.792666
B    1.362441
C    1.066439
D    0.595773
dtype: float64

In [157]:
#Histogram
s = pd.Series(np.random.randint(0,7,size=10))

In [158]:
s

0    3
1    0
2    2
3    3
4    2
5    2
6    5
7    5
8    3
9    2
dtype: int64

In [159]:
s.value_counts()

2    4
3    3
5    2
0    1
dtype: int64

In [160]:
#String Methods
s = pd.Series(['A','B','C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [163]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [164]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [166]:
# Merge
df = pd.DataFrame(np.random.randn(10,4))

In [167]:
df

          0         1         2         3
0  0.709991 -0.898339 -1.193623  1.189233
1  0.718824  0.273966 -0.769661 -1.165149
2  0.908708  1.115534  2.507243  1.141714
3  1.341495 -0.421951 -1.670756  1.402995
4 -0.169769 -0.246026 -0.007837 -1.175970
5 -0.351897 -1.068552 -2.054293 -0.726467
6 -0.614573 -0.014950 -0.977356  0.794890
7  0.640165 -0.084633 -1.473842  1.739214
8  0.321042 -0.698902 -0.604726 -0.939661
9 -2.099743  1.160557  2.085374 -0.408732

In [170]:
picies = [df[:3],df[3:7],df[7:]]

In [171]:
picies

[          0         1         2         3
 0  0.709991 -0.898339 -1.193623  1.189233
 1  0.718824  0.273966 -0.769661 -1.165149
 2  0.908708  1.115534  2.507243  1.141714,
           0         1         2         3
 3  1.341495 -0.421951 -1.670756  1.402995
 4 -0.169769 -0.246026 -0.007837 -1.175970
 5 -0.351897 -1.068552 -2.054293 -0.726467
 6 -0.614573 -0.014950 -0.977356  0.794890,
           0         1         2         3
 7  0.640165 -0.084633 -1.473842  1.739214
 8  0.321042 -0.698902 -0.604726 -0.939661
 9 -2.099743  1.160557  2.085374 -0.408732]

In [172]:
pd.concat(picies)

          0         1         2         3
0  0.709991 -0.898339 -1.193623  1.189233
1  0.718824  0.273966 -0.769661 -1.165149
2  0.908708  1.115534  2.507243  1.141714
3  1.341495 -0.421951 -1.670756  1.402995
4 -0.169769 -0.246026 -0.007837 -1.175970
5 -0.351897 -1.068552 -2.054293 -0.726467
6 -0.614573 -0.014950 -0.977356  0.794890
7  0.640165 -0.084633 -1.473842  1.739214
8  0.321042 -0.698902 -0.604726 -0.939661
9 -2.099743  1.160557  2.085374 -0.408732

In [180]:
#Join : sql style maerge
left = pd.DataFrame({'key':['foo','foo'],'lval':[1,2]})

In [181]:
right = pd.DataFrame({'key':['foo','foo'],'rval':[3,4]})

In [182]:
left

   key  lval
0  foo     1
1  foo     2

In [183]:
right

   key  rval
0  foo     3
1  foo     4

In [184]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     3
1  foo     1     4
2  foo     2     3
3  foo     2     4